{
    "Work Experience": [
        {
            "role": "Data Structures Teacher’s Assistant",
            "organization": "Mount Holyoke College",
            "location": "South Hadley, MA, USA",
            "duration": "Sep 2021 - Present",
            "description": [
                "Lead 3 weekly TA/Lab sessions, teaching data structures & algorithms concept to over 100 students and mentored 12-15 students per semester, fostering peer collaboration and continuous improvement, culminating in a 12% rise in pass rates.",
                "Enhance students’ code proficiency and algorithmic comprehension through meticulous debugging and troubleshooting of key concepts, significantly elevating their ability to write clean, efficient code."
            ],
            "category": "employment"
        },
        {
            "role": "Full-Stack Web Developer",
            "organization": "Mount Holyoke College",
            "location": "South Hadley, MA, USA",
            "duration": "Aug 2021 - Present",
            "description": [
                "Collaborate in a team of 4 in architecting a community-centric web application utilizing the MERN stack (MongoDB, Express.js, React, Node.js), aimed at enriching the educational and social experience of a 200+ student body. Contributed to comprehensive planning phases — from system and class diagramming to crafting user stories and leading weekly standups — to facilitate a seamless and robust development process.",
                "Maintain the website, diligently managing content updates and resource allocation to meet the evolving needs of the student body. Instituted a structured feedback loop to capture and integrate student insights, thereby continuously refining the user journey."
            ],
            "category": "employment"
        },
        {
            "role": "Software Engineering Intern",
            "organization": "Fama Technologies Inc.",
            "location": "Remote",
            "duration": "Jun 2023 - Aug 2023",
            "description": [
                "Developed and deployed a dynamic billing application using React.js, TypeScript, and Tailwind CSS, facilitating efficient tracking and management of client subscriptions, payments, and financials across various company profiles.",
                "Engineered robust backend API services using Python employing RESTful principles such as consistent endpoint naming, stateless architecture, and appropriate use of HTTP verbs to enhance conditional query handling and data control. Integrated React Query for streamlined data fetching and effective state management at API endpoint interactions.",
                "Optimized client-side interactions through strategic use of React’s context and state management capabilities, enhancing the application's responsiveness and enabling real-time updates of user data without sacrificing performance.",
                "Instituted robust permission controls within the application infrastructure, safeguarding sensitive data and restricting access to authorized administrative personnel, reinforcing compliance and operational integrity.",
                "Employed Kanban for continuous delivery and task prioritization, successfully transitioning the comprehensive billing system to a production environment with assured performance, robust security, and seamless end-user functionality in a live setting."
            ],
            "category": "internship"
        },
        {
            "role": "Above and Beyond Computer Science Fellow",
            "organization": "Meta",
            "location": "Remote",
            "duration": "Aug 2022 - Dec 2022",
            "description": [
                "Engaged in screen-cast-led workshops by Meta engineers, enhancing understanding of complex data structures and their practical applications in technical interviews and industry practices.",
                "Participated in mock interviews and breakout sessions, focusing on vital soft skills like proactive communication and time management, crucial for successful technical interviews."
            ],
            "category": "fellowship"
            },
            {
            "role": "Work Prep Program Fellow",
            "organization": "JP Morgan Chase",
            "location": "Remote",
            "duration": "May 2022 - May 2022",
            "description": [
            "Attended 6 technical and professional development workshops led by senior leaders and engineers at JPMorgan Chase & Co., gaining insights into the strategic application of technology within the finance industry.",
            "Prototyped a mental health app, 'Upside,' by leveraging design thinking and empathetic approaches to craft technology that serves social good and supports well-being."
            ],
            "category": "fellowship"
            },
            {
            "role": "iOS Development Tech Fellow",
            "organization": "CodePath",
            "location": "Remote",
            "duration": "Oct 2021 - Apr 2022",
            "description": [
            "Developed 4 iOS applications, harnessing Swift, RESTful APIs, Parse backend integration, UIKit dynamics, and network handling with Alamofire.",
            "Reinforced a solid foundation in iOS development concepts, including view controllers, networking, and persistent data storage, by completing CodePath's challenging labs and assignments — from conceptualizing a simple tip calculator to engineering a fully functional Instagram clone.",
            "Coordinated hands-on labs, enhancing student skills in areas such as Auto Layout, MVC patterns, and gesture-driven interfaces, which directly contributed to their development of applications like Tumblr and Twitter clients.",
            "Led a cohort of 19 students through the same curriculum, emphasizing practical application of iOS engineering principles designed by industry experts, leading to a demo day."
            ],
            "category": "fellowship"
            }
            ],
            "Leadership": [
            {
            "role": "President & Founder",
            "organization": "Girls Who Code Chapter at Mount Holyoke",
            "duration": "April 2022 – Present",
            "description": [
            "Recruited over 200 members within 6 months, led team of 9 eboard members in facilitating 12+ events/workshops per semester, bolstering community engagement, and advancing skills and professional development.",
            "Launched a technical interview program, elevating interview confidence for 86% of participants, enhancing career readiness."
            ],
            "category": "leadership"
            },
            {
            "role": "Full-Stack Developer",
            "organization": "Computer Science Society",
            "duration": "January 2022 – Present",
            "description": [
            "Collaborate in a team of 4 to develop community-focused web application using MERN stack, catering to over 200 students.",
            "Maintain website with resources, ensuring an optimal user experience by monitoring performance and consistent feedback."
            ],
            "category": "leadership"
            }
            ],
            "Projects": [
            {
            "name": "Spotify Social Web Application",
            "duration": "June 2023",
            "description": [
            "Engineered a single-page application with React.js and Material UI designing dynamic components to render user-specific data, such as top songs and artists, fetched from the Spotify API.",
            "Leveraged Express.js in constructing a backend infrastructure, managing API and database interactions initiated by user requests from the React.js frontend, ensuring seamless client-server communication.",
            "Deployed Firebase for real-time data storage and retrieval, facilitating essential features such as user profile management, interactive social forums, and the ability to query for specific forums."
            ],
            "category": "project"
            },
            {
            "name": "Bike Rental Web Application (Project Link)",
            "duration": "March 2023",
            "description": [
            "Architected and launched a bike rental platform using the Ruby on Rails framework, leveraging MySQL for robust data storage and JavaScript and CSS for dynamic front-end interactions, resulting in a comprehensive MVP hosted on Heroku.",
            "Integrated Google Maps API for interactive map and station locator and Devise & Omniauth for (third-party) authentication.",
            "Applied Agile methodologies (Scrum) to manage the project lifecycle, from initial system design and class diagrams to iterative development and deployment, ensuring continuous integration of user-centered features and responsive design elements."
            ],
            "category": "project"
            },
            {
            "name": "Android Personal Finance Management App (Winner Finance Track, HackHolyoke)",
            "duration": "November 2021",
            "description": [
            "Developed app with Java, Android SDK with Firebase authentication, and visualization of user finances via diverse graphs.",
            "Established a NLP pipeline for receipt extraction using OpenCV and MLKit, enabling accurate text detection in receipts.",
            "Extracted strings using Tesseract model from the bounding boxes, followed by Regex post-processing to eliminate artifacts."
            ],
            "category": "project"
            },
            {
            "name": "Multi-platform travel management app (itimoney) | TechTogether Boston 2022",
            "duration": "Winner Data Science Track",
            "team": "3 developers",
            "description": [
            "Developed interface using Flutter and Dart for an app that helps track finances while travelling.",
            "Parsed the data fetched from CapitalOne API into JSON and visualized the data in a graph using python.",
            "Prototyped the functionalities of app using Figma and designed using Canva."
            ],
            "category": "project"
            },
            {
            "name": "Android app for donation (CareBuddy) | HackHolyoke 2020",
            "duration": "1st Place general track",
            "team": "4 developers",
            "description": [
            "Launched an android native app that uses pre-built functionalities making the donation process easier for doner and donee.",
            "Utilized Java, android SDK, SQL for data management and firebase for user authentication and store user data in real time."
            ],
            "category": "project"
            },
            {
            "name": "IOS app using custom backend server (Instagram Clone)",
            "description": [
            "Utilized Swift, UIKit, cocoa touch to make a clone of Instagram with a global photos feed.",
            "Implemented Parse and Back4app for custom configured backend allowing user to post photos and add comments.",
            "Queried Parse for posts, likes and comments and displayed them in a table view using auto layout."
            ],
            "category": "project"
        }
    ]
}

